Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# Settings_HyperVFirewall.Description
source: Enables Hyper-V firewall which allows the Windows Firewall rules, as well as rules specific to Hyper-V traffic, to filter WSL network traffic.
cs_cz: Povolí bránu firewall technologie Hyper-V, která umožňuje filtrovat síťový provoz WSL pomocí pravidel brány Windows Firewall a pravidel specifických pro přenosy technologie Hyper-V.
da_dk: Aktiverer Hyper-V-firewall, der tillader, at WSL-netværkstrafik filtreres i reglerne for Windows Firewall samt regler, der er specifikke for Hyper-V-trafik.
de_de: Aktiviert die Hyper-V-Firewall, mit der die Windows-Firewall-Regeln sowie regeln, die für Hyper-V-Datenverkehr spezifisch sind, den WSL-Netzwerkdatenverkehr filtern.
el_gr: Ενεργοποιεί το τείχος προστασίας Hyper-V το οποίο επιτρέπει στους κανόνες του Τείχους προστασίας των Windows, καθώς και στους κανόνες ειδικά για την κυκλοφορία του Hyper-V, να φιλτράρουν την κυκλοφορία δικτύου του WSL.
es_es: Habilita el firewall de Hyper-V, que permite que las reglas de Firewall de Windows, así como las reglas específicas del tráfico de Hyper-V, filtre el tráfico de red de WSL.
fi_fi: Ottaa käyttöön Hyper-V-palomuurin, joka sallii Windowsin palomuurin sääntöjen ja Hyper-V-liikennettä koskevien sääntöjen suodattaa WSL-verkkoliikennettä.
fr_fr: Active le pare-feu Hyper-V qui permet aux règles du Pare-feu Windows, ainsi qu’aux règles spécifiques au trafic Hyper-V, de filtrer le trafic réseau WSL.
hu_hu: Engedélyezi a Hyper-V tűzfalat, amely lehetővé teszi a Windows tűzfal szabályait, valamint a Hyper-V-forgalomra vonatkozó szabályokat a WSL hálózati forgalom szűréséhez.
it_it: Abilita il firewall Hyper-V, che consente alle regole di Windows Firewall, nonché alle regole specifiche del traffico Hyper-V, di filtrare il traffico di rete WSL.
ja_jp: Windows ファイアウォール規則および Hyper-V トラフィックに固有の規則を許可して WSL ネットワーク トラフィックをフィルター処理できるようにする Hyper-V ファイアウォールを有効にします。
ko_kr: WSL 네트워크 트래픽을 필터링하기 위해 Windows 방화벽 규칙과 Hyper-V 트래픽에 대한 규칙을 허용하는 Hyper-V 방화벽을 사용하도록 설정합니다.
nb_no: Aktiverer Hyper-V-brannmur som tillater reglene for Windows-brannmur, i tillegg til regler som er spesifikke for Hyper-V-trafikk, for å filtrere WSL-nettverkstrafikk.
nl_nl: Hiermee wordt de Hyper-V-firewall ingeschakeld waarmee de Windows Firewall-regels en regels die specifiek zijn voor Hyper-V-verkeer, WSL-netwerkverkeer kunnen filteren.
pl_pl: Włącza zaporę funkcji Hyper-V, która umożliwia regułom Zapory systemu Windows, a także regułom specyficznym dla ruchu funkcji Hyper-V, filtrowanie ruchu sieciowego WSL.
pt_br: Habilita o firewall do Hyper-V, que permite que as regras do Firewall do Windows, bem como regras específicas do tráfego do Hyper-V, filtrem o tráfego de rede WSL.
pt_pt: Ativa a firewall do Hyper-V que permite que as regras da Firewall do Windows, bem como regras específicas do tráfego hyper-V, filtrem o tráfego de rede WSL.
ru_ru: Включает брандмауэр Hyper-V, позволяющий правилам брандмауэра Windows, а также правилам, специфичным для трафика Hyper-V, фильтровать сетевой трафик WSL.
sv_se: Aktiverar Hyper-V-brandväggen som gör att Windows-brandväggsreglerna och regler som är specifika för Hyper-V-trafik kan filtrera WSL-nätverkstrafik.
tr_tr: WSL ağ trafiğini filtrelemek için Windows Güvenlik Duvarı kurallarının yanı sıra Hyper-V trafiğine özel kurallara izin veren Hyper-V güvenlik duvarını sağlar.
zh_cn: 启用 Hyper-V 防火墙，该防火墙允许 Windows 防火墙规则以及 Hyper-V 流量特定的规则来筛选 WSL 网络流量。
zh_tw: 啟用 Hyper-V 防火牆，允許 Windows 防火牆規則以及 Hyper-V 流量專用的規則，以篩選 WSL 網路流量。

# Settings_HyperVFirewallToggleSwitch.AutomationProperties.Name
source: Hyper-V Firewall enabled.
cs_cz: Brána firewall technologie Hyper-V povolena.
da_dk: Hyper-V Firewall er aktiveret.
de_de: Hyper-V-Firewall aktiviert.
el_gr: Ενεργοποιημένο τείχος προστασίας Hyper-V.
es_es: Firewall de Hyper-V habilitado.
fi_fi: Hyper-V-palomuuri käytössä.
fr_fr: Pare-feu Hyper-V activé.
hu_hu: Hyper-V tűzfal engedélyezve.
it_it: Firewall Hyper-V abilitato.
ja_jp: Hyper-V ファイアウォールが有効です。
ko_kr: Hyper-V 방화벽을 사용하도록 설정했습니다.
nb_no: Hyper-V-brannmur aktivert.
nl_nl: Hyper-V Firewall ingeschakeld.
pl_pl: Włączono zaporę funkcji Hyper-V.
pt_br: Firewall do Hyper-V habilitado.
pt_pt: Firewall de Hyper-V ativada.
ru_ru: Брандмауэр Hyper-V включен.
sv_se: Hyper-V-brandväggen har aktiverats.
tr_tr: Hyper-V Güvenlik Duvarı etkin.
zh_cn: 已启用 Hyper-V 防火墙。
zh_tw: 已啟用 Hyper-V 防火牆。

# Settings_HyperVFirewallToggleSwitch.AutomationProperties.HelpText
source: Enables Hyper-V firewall which allows the Windows Firewall rules, as well as rules specific to Hyper-V traffic, to filter WSL network traffic.
cs_cz: Povolí bránu firewall technologie Hyper-V, která umožňuje filtrovat síťový provoz WSL pomocí pravidel brány Windows Firewall a pravidel specifických pro přenosy technologie Hyper-V.
da_dk: Aktiverer Hyper-V-firewall, der tillader, at WSL-netværkstrafik filtreres i reglerne for Windows Firewall samt regler, der er specifikke for Hyper-V-trafik.
de_de: Aktiviert die Hyper-V-Firewall, mit der die Windows-Firewall-Regeln sowie regeln, die für Hyper-V-Datenverkehr spezifisch sind, den WSL-Netzwerkdatenverkehr filtern.
el_gr: Ενεργοποιεί το τείχος προστασίας Hyper-V το οποίο επιτρέπει στους κανόνες του Τείχους προστασίας των Windows, καθώς και στους κανόνες ειδικά για την κυκλοφορία του Hyper-V, να φιλτράρουν την κυκλοφορία δικτύου του WSL.
es_es: Habilita el firewall de Hyper-V, que permite que las reglas de Firewall de Windows, así como las reglas específicas del tráfico de Hyper-V, filtre el tráfico de red de WSL.
fi_fi: Ottaa käyttöön Hyper-V-palomuurin, joka sallii Windowsin palomuurin sääntöjen ja Hyper-V-liikennettä koskevien sääntöjen suodattaa WSL-verkkoliikennettä.
fr_fr: Active le pare-feu Hyper-V qui permet aux règles du Pare-feu Windows, ainsi qu’aux règles spécifiques au trafic Hyper-V, de filtrer le trafic réseau WSL.
hu_hu: Engedélyezi a Hyper-V tűzfalat, amely lehetővé teszi a Windows tűzfal szabályait, valamint a Hyper-V-forgalomra vonatkozó szabályokat a WSL hálózati forgalom szűréséhez.
it_it: Abilita il firewall Hyper-V, che consente alle regole di Windows Firewall, nonché alle regole specifiche del traffico Hyper-V, di filtrare il traffico di rete WSL.
ja_jp: Windows ファイアウォール規則および Hyper-V トラフィックに固有の規則を許可して WSL ネットワーク トラフィックをフィルター処理できるようにする Hyper-V ファイアウォールを有効にします。
ko_kr: WSL 네트워크 트래픽을 필터링하기 위해 Windows 방화벽 규칙과 Hyper-V 트래픽에 대한 규칙을 허용하는 Hyper-V 방화벽을 사용하도록 설정합니다.
nb_no: Aktiverer Hyper-V-brannmur som tillater reglene for Windows-brannmur, i tillegg til regler som er spesifikke for Hyper-V-trafikk, for å filtrere WSL-nettverkstrafikk.
nl_nl: Hiermee wordt de Hyper-V-firewall ingeschakeld waarmee de Windows Firewall-regels en regels die specifiek zijn voor Hyper-V-verkeer, WSL-netwerkverkeer kunnen filteren.
pl_pl: Włącza zaporę funkcji Hyper-V, która umożliwia regułom Zapory systemu Windows, a także regułom specyficznym dla ruchu funkcji Hyper-V, filtrowanie ruchu sieciowego WSL.
pt_br: Ativa a firewall do Hyper-V que permite que as regras da Firewall do Windows, bem como regras específicas do tráfego hyper-V, filtrem o tráfego de rede WSL.
pt_pt: Ativa a firewall do Hyper-V que permite que as regras da Firewall do Windows, bem como regras específicas do tráfego hyper-V, filtrem o tráfego de rede WSL.
ru_ru: Включает брандмауэр Hyper-V, позволяющий правилам брандмауэра Windows, а также правилам, специфичным для трафика Hyper-V, фильтровать сетевой трафик WSL.
sv_se: Aktiverar Hyper-V-brandväggen som gör att Windows-brandväggsreglerna och regler som är specifika för Hyper-V-trafik kan filtrera WSL-nätverkstrafik.
tr_tr: WSL ağ trafiğini filtrelemek için Windows Güvenlik Duvarı kurallarının yanı sıra Hyper-V trafiğine özel kurallara izin veren Hyper-V güvenlik duvarını sağlar.
zh_cn: 启用 Hyper-V 防火墙，该防火墙允许 Windows 防火墙规则以及 Hyper-V 流量特定的规则来筛选 WSL 网络流量。
zh_tw: 啟用 Hyper-V 防火牆，允許 Windows 防火牆規則以及 Hyper-V 流量專用的規則，以篩選 WSL 網路流量。

# Settings_HostAddressLoopback.Header
source: Host Address Loopback
cs_cz: Zpětná smyčka adresy hostitele
da_dk: Tilbagekobling af værtsadresse
de_de: Hostadress-Loopback
el_gr: Διεύθυνση επαναφοράς κεντρικού υπολογιστή (Host Address Loopback)
es_es: Bucle invertido de dirección de host
fi_fi: Isäntäosoitteen silmukka
fr_fr: Adresse d’hôte Loop
hu_hu: Állomáscím visszacsatolása
it_it: Loopback degli indirizzi host
ja_jp: ホスト アドレスのループバック
ko_kr: 호스트 주소 Loopback
nb_no: Tilbakekobling for vertsadresse
nl_nl: Loopback van hostadres
pl_pl: Sprzężenie zwrotne adresów hosta
pt_br: Loopback de Endereço de Host
pt_pt: Loopback do Endereço de Anfitrião
ru_ru: Адрес узла замыкания на себя
sv_se: Loopback för värdadress
tr_tr: Ana Bilgisayar Adresi Geri Döngüsü
zh_cn: 主机地址环回
zh_tw: 主機位址回送

# Settings_HostAddressLoopback.Description
source: Only applicable when wsl2.networkingMode is set to mirrored. When set to True, will allow the Container to connect to the Host, or the Host to connect to the Container, by an IP address that's assigned to the Host. Note that the 127.0.0.1 loopback address can always be used - this option allows for all additionally assigned local IP addresses to be used as well.
cs_cz: Lze použít pouze v případě, že je wsl2.networkingMode nastaveno na zrcadlené. Když se tato možnost nastaví na True, kontejner se bude moct připojit k hostiteli nebo hostiteli, aby se připojil ke kontejneru pomocí IP adresy přiřazené k hostiteli. Poznámka: Vždy je možné použít adresu zpětné smyčky 127.0.0.1 – tato možnost umožňuje používat i všechny dodatečně přiřazené místní IP adresy.
da_dk: Gælder kun, når wsl2.networkingMode er indstillet til spejlet. Når den er indstillet til Sand, kan objektbeholderen oprette forbindelse til værten eller værten for at oprette forbindelse til objektbeholderen af en IP-adresse, der er tildelt værten. Bemærk, at tilbagekoblingsadressen 127.0.0.1 altid kan bruges – denne indstilling gør det muligt også at bruge alle yderligere tildelte lokale IP-adresser.
de_de: Gilt nur, wenn wsl2.networkingMode auf "gespiegelt" festgelegt ist. Bei Festlegung auf TRUE kann der Container über eine ip-Adresse, die dem Host zugewiesen ist, eine Verbindung mit dem Host herstellen oder vom Host eine Verbindung mit dem Container herstellen. Beachten Sie, dass die Loopbackadresse 127.0.0.1 immer verwendet werden kann. Mit dieser Option können auch alle zusätzlich zugewiesenen lokalen IP-Adressen verwendet werden.
el_gr: Ισχύει μόνο όταν το wsl2.networkingMode έχει οριστεί σε mirrored. Όταν οριστεί σε True, θα επιτρέψει στο κοντέινερ να συνδεθεί στον Κεντρικό υπολογιστή ή στον Κεντρικό υπολογιστή να συνδεθεί στο κοντέινερ, μέσω μιας διεύθυνσης IP που έχει εκχωρηθεί στον Κεντρικό υπολογιστή. Σημειώστε ότι η διεύθυνση επαναφοράς 127.0.0.1 μπορεί πάντα να χρησιμοποιηθεί - αυτή η επιλογή επιτρέπει να χρησιμοποιούνται επίσης όλες οι πρόσθετες τοπικές διευθύνσεις IP που έχουν εκχωρηθεί.
es_es: Solo es aplicable cuando wsl2.networkingMode se establece en reflejado. Cuando se establece en True, permitirá que el contenedor se conecte al host o que el host se conecte al contenedor mediante una dirección IP asignada al host. Tenga en cuenta que siempre se puede usar la dirección de bucle invertido 127.0.0.1. Esta opción también permite usar todas las direcciones IP locales asignadas adicionalmente.
fi_fi: Käytettävissä vain, kun wsl2.networkingMode on asetettu peilatuksi. Kun asetus on True, säilö voi muodostaa yhteyden isäntään tai isäntään muodostamaan yhteyden säilöön isäntään määritetyllä IP-osoitteella. Huomaa, että 127.0.0.1-silmukkaosoitetta voi aina käyttää – tämä vaihtoehto mahdollistaa myös kaikkien lisäksi määritettyjen paikallisten IP-osoitteiden käyttämisen.
fr_fr: Applicable uniquement lorsque wsl2.networkingMode est défini sur la mise en miroir. Quand la valeur est True, le conteneur peut se connecter à l’hôte ou à l’hôte pour se connecter au conteneur, par une adresse IP attribuée à l’hôte. Notez que l’adresse de bouclage 127.0.0.1 peut toujours être utilisée . Cette option permet également d’utiliser toutes les adresses IP locales affectées en plus.
hu_hu: Csak akkor alkalmazható, ha wsl2.networkingMode tükrözöttre van beállítva. Ha Igaz értékre van állítva, a tároló egy, a gazdagéphez rendelt IP-cím használatával csatlakozhat a gazdagéphez, vagy a gazdagép csatlakozhat a tárolóhoz. Vegye figyelembe, hogy a 127.0.0.1 visszacsatolási cím mindig használható – ez a beállítás lehetővé teszi az összes további hozzárendelt helyi IP-cím használatát is.
it_it: Applicabile solo quando wsl2.networkingMode è impostato su mirroring. Se impostato su True, consentirà al contenitore di connettersi all'host o all'host di connettersi al contenitore tramite un indirizzo IP assegnato all'host. Si noti che è sempre possibile usare l'indirizzo di loopback 127.0.0.1. Questa opzione consente anche l'uso di tutti gli indirizzi IP locali assegnati.
ja_jp: wsl2.networkingMode が mirrored に設定されている場合にのみ適用されます。True に設定すると、ホストに割り当てられている IP アドレスによって、コンテナーがホストに接続するか、ホストがコンテナーに接続できるようになります。127.0.0.1 ループバック アドレスは常に使用できることに注意してください。このオプションでは、追加で割り当てられたすべてのローカル IP アドレスも使用できます。
ko_kr: wsl2.networkingMode 미러링으로 설정된 경우에만 적용할 수 있습니다. True로 설정하면 호스트에 할당된 IP 주소로 컨테이너가 호스트에 연결하거나 호스트가 컨테이너에 연결할 수 있습니다. 127.0.0.1 루프백 주소는 항상 사용할 수 있습니다. 이 옵션을 사용하면 추가로 할당된 모든 로컬 IP 주소도 사용할 수 있습니다.
nb_no: Gjelder bare når wsl2.networkingMode er avspeilet. Når satt til Sann, tillates beholderen å koble til verten, eller verten for å koble til beholderen, med en IP-adresse som er tilordnet verten. Vær oppmerksom på at 127.0.0.1-tilbakekoblingsadressen alltid kan brukes . Dette alternativet gjør det mulig å bruke alle ekstra tilordnede lokale IP-adresser også.
nl_nl: Alleen van toepassing wanneer wsl2.networkingMode is ingesteld op gespiegeld. Als deze optie is ingesteld op Waar, kan de container verbinding maken met de host of de host om verbinding te maken met de container door een IP-adres dat aan de host is toegewezen. Het loopback-adres 127.0.0.1 kan altijd worden gebruikt. Met deze optie kunnen ook alle extra toegewezen lokale IP-adressen worden gebruikt.
pl_pl: Ma zastosowanie tylko wtedy, gdy wsl2.networkingMode jest ustawiony na dublowany. Po ustawieniu wartości True kontener będzie mógł łączyć się z hostem lub hostem w celu nawiązania połączenia z kontenerem za pomocą adresu IP przypisanego do hosta. Pamiętaj, że adres sprzężenia zwrotnego 127.0.0.1 może być zawsze używany — ta opcja umożliwia również użycie wszystkich dodatkowo przypisanych lokalnych adresów IP.
pt_br: Aplicável somente quando wsl2.networkingMode está definido como espelhado. Quando definido como True, permitirá que o Contêiner se conecte ao Host ou ao Host para se conectar ao Contêiner por um endereço IP atribuído ao Host. Observe que o endereço de loopback 127.0.0.1 sempre pode ser usado - essa opção permite que todos os endereços IP locais atribuídos corretamente também sejam usados.
pt_pt: Apenas aplicável quando wsl2.networkingMode está definido como espelhado. Quando definido como Verdadeiro, permitirá ao Contentor ligar ao Anfitrião ou ao Anfitrião ligar ao Contentor através de um endereço IP atribuído ao Anfitrião. Tenha em atenção que o endereço de loopback 127.0.0.1 pode sempre ser utilizado - esta opção também permite a utilização de todos os endereços IP locais atribuídos adicionalmente.
ru_ru: Применимо только в том случае, если для wsl2.networkingMode установлено зеркальное отображение. Если установлено значение ИСТИНА, контейнеру будет разрешено подключаться к узлу или узлу подключаться к контейнеру по IP-адресу, назначенному узлу. Обратите внимание, что адрес замыкания на себя 127.0.0.1 можно использовать всегда — эта опция позволяет также использовать все дополнительно назначенные локальные IP-адреса.
sv_se: Gäller endast när wsl2.networkingMode är inställt på spegling. När värdet är True tillåter det att containern ansluter till värden, eller värden, för att ansluta till containern, via en IP-adress som tilldelats värden. Observera att loopback-adressen 127.0.0.1 alltid kan användas – med det här alternativet kan även alla ytterligare tilldelade lokala IP-adresser användas.
tr_tr: Yalnızca wsl2.networkingMode olarak ayarlandığında uygulanabilir. True olarak ayarlandığında, Kapsayıcının Ana Bilgisayara veya Konak'a atanmış bir IP adresiyle Kapsayıcıya bağlanmasına izin ver. 127.0.0.1 geri döngü adresinin her zaman kullanabildiğine dikkat edin. Bu seçenek, ek olarak atanmış tüm yerel IP adreslerinin de kullanılabilir olduğunu unutmayın.
zh_cn: 仅当 wsl2.networkingMode 设置为镜像(mirrored)时适用。设置为 True 时，将允许容器与主机通过分配给主机的 IP 地址互相连接。请注意，始终可以使用 127.0.0.1 环回地址 - 此选项还允许使用所有额外分配的本地 IP 地址。
zh_tw: 只有在 wsl2.networkingMode 設為鏡像時才適用。設定為 True 時，將允許容器透過指派給主機的 IP 位址連線到主機，或允許主機連線到容器。請注意，一律可以使用 127.0.0.1 回送位址 - 此選項也允許使用所有額外指派的本機 IP 位址。

# Settings_HostAddressLoopbackToggleSwitch.AutomationProperties.Name
source: Host Address Loopback.
cs_cz: Zpětná smyčka adresy hostitele.
da_dk: Tilbagekobling af værtsadresse.
de_de: Hostadressen-Loopback.
el_gr: Διεύθυνση επαναφοράς κεντρικού υπολογιστή (Host Address Loopback).
es_es: Bucle invertido de dirección de host.
fi_fi: Isäntäosoitteen silmukka.
hu_hu: Állomáscím visszacsatolása.
it_it: Loopback degli indirizzi host.
ja_jp: ホスト アドレスのループバック。
ko_kr: 호스트 주소 Loopback.
nb_no: Vertsadressetilbakekobling.
nl_nl: Loopback van hostadres.
pl_pl: Sprzężenie zwrotne adresów hosta.
pt_br: Loopback de Endereço de Host.
pt_pt: Loopback do Endereço de Anfitrião
ru_ru: Адрес узла замыкания на себя.
sv_se: Loopback för värddatoradress.
tr_tr: Ana Bilgisayar Adresi Geri Döngüsü.
zh_cn: 主机地址环回。
zh_tw: 主機位址回送。
